# LEET CODE
## Problem-602: Friend Requests II: Who Has the Most Friend
Class: Medium

Source: https://leetcode.com/problems/friend-requests-ii-who-has-the-most-friends
## Description

Table: RequestAccepted
| Column Name    | Type    |
|----------------|---------|
| requester_id   | int     |
| accepter_id    | int     |
| accept_date    | date    |

- (requester_id, accepter_id) is the primary key (combination of columns with unique values) for this table.
- This table contains the ID of the user who sent the request, the ID of the user who received the request, and the date when the request was accepted.

## To Do
Write a solution to find the people who have the most friends and the most friends number.

The test cases are generated so that only one person has the most friends.

The result format is in the following example.

## Example

Input: 

RequestAccepted table:
| requester_id | accepter_id | accept_date |
|--------------|-------------|-------------|
| 1            | 2           | 2016/06/03  |
| 1            | 3           | 2016/06/08  |
| 2            | 3           | 2016/06/08  |
| 3            | 4           | 2016/06/09  |

Output: 
| id | num |
|----|-----|
| 3  | 3   |

Explanation: 
- The person with id 3 is a friend of people 1, 2, and 4, so he has three friends in total, which is the most number than any others.
|

## Importing

In [1]:
import pandas as pd
from pandasql import sqldf

## Define Schema

In [4]:
data = {
    'requester_id': [1, 1, 2, 3],
    'accepter_id': [2, 3, 3, 4],
    'accept_date': ['2016/06/03', '2016/06/08', '2016/06/08', '2016/06/09']
}

RequestAccepted = pd.DataFrame(data)

#RequestAccepted['accept_date'] = pd.to_datetime(RequestAccepted['accept_date'])

RequestAccepted

   requester_id  accepter_id accept_date
0             1            2  2016/06/03
1             1            3  2016/06/08
2             2            3  2016/06/08
3             3            4  2016/06/09

In [13]:
data = {
    'requester_id': [1, 1, 2, 4],
    'accepter_id': [2, 3, 3, 3],
    'accept_date': ['2016/06/03', '2016/06/08', '2016/06/08', '2016/06/09']
}

RequestAccepted_2 = pd.DataFrame(data)
# RequestAccepted_2['accept_date'] = pd.to_datetime(RequestAccepted_2['accept_date'])

RequestAccepted_2

   requester_id  accepter_id accept_date
0             1            2  2016/06/03
1             1            3  2016/06/08
2             2            3  2016/06/08
3             4            3  2016/06/09

## Task

In [46]:
# Define the SQL query
query = """
WITH most_requester AS (
    SELECT requester_id AS id, COUNT(*) AS num
    FROM RequestAccepted
    GROUP BY requester_id
),
most_accepter AS (
    SELECT accepter_id AS id, COUNT(*) AS num
    FROM RequestAccepted
    GROUP BY accepter_id
)
SELECT id, SUM(num) AS num
FROM (
    SELECT *
    FROM most_requester
    UNION ALL 
    SELECT * FROM most_accepter
) AS requests
GROUP BY id
ORDER BY num DESC
LIMIT 1
;
"""

# Excute the query using pandasql
result = sqldf(query, env={'RequestAccepted':RequestAccepted})

# Display the result dataframe
display(result)

   id  num
0   3    3

In [45]:
# Define the SQL query
query = """
WITH most_requester AS (
    SELECT requester_id AS id, COUNT(*) AS num
    FROM RequestAccepted
    GROUP BY requester_id
),
most_accepter AS (
    SELECT accepter_id AS id, COUNT(*) AS num
    FROM RequestAccepted
    GROUP BY accepter_id
)
SELECT id, SUM(num) AS num
FROM (
    SELECT *
    FROM most_requester
    UNION ALL 
    SELECT * FROM most_accepter
) AS requests
GROUP BY id
ORDER BY num DESC
LIMIT 1
;
"""

# Excute the query using pandasql
result = sqldf(query, env={'RequestAccepted':RequestAccepted_2})

# Display the result dataframe
display(result)

   id  num
0   3    3

Expected: 

| id | num |
| -- | --- |
| 3  | 3   |

### More simplified Solution

In [50]:
# Define the SQL query
query = """
select id , count(id) as num
from (

    select requester_id as id from RequestAccepted
    union all
    select accepter_id AS id from RequestAccepted
)s
group by id
order by count(id) desc limit 1 ;
"""

# Excute the query using pandasql
result = sqldf(query, env={'RequestAccepted':RequestAccepted_2})

# Display the result dataframe
display(result)

   id  num
0   3    3